#Даны два числа A и B
#В этой задаче для работы с входными и выходными данными вы можете использовать и файлы и потоки на ваше усмотрение.
#a,b = input().split()
    a = int(a)
    b = int(b)
    if (a >= -2000000000 and a <= 2000000000 and b >= -2000000000 and b <= 2000000000):
        print(a + b)
	print("not digits")